[
  {
    "id": "1",
    "heading": "Add a dark theme option",
    "body": "It would help people with light sensitivities and who prefer dark mode.",
    "numberOfComments": 4,
    "numberOfUpvotes": 15,
    "category": "Feature",
    "comments": [
      {
        "id": "1",
        "parentCommentId": "",
        "username": "john@babel.com",
        "comment": "Also, please allow styles to be applied based on system preferences. I would love to be able to browse Frontend Mentor in the evening after my device's dark mode turns on without the bright background it currently has."
      },
      {
        "id": "2",
        "parentCommentId": "",
        "username": "Emily12@babel.com",
        "comment": "Second this! I do a lot of late night coding and reading. Adding a dark theme can be great for preventing eye strain and the headaches that result. It's also quite a trend with modern apps and  apparently saves battery life."
      },
      {
        "id": "3",
        "user": "Michael",
        "username": "Michael99@babel.com",
        "comment": "While waiting for dark mode, there are browser extensions that will also do the job. Search for dark theme followed by your browser. There might be a need to turn off the extension for sites with naturally black backgrounds though."
      },
      {
        "id": "4",
        "user": "Sophia",
        "username": "Sophia99@babel.com",
        "comment": "Good point! Using any kind of style extension is great and can be highly customizable, like the ability to change contrast and brightness. I'd prefer not to use one of such extensions, however, for security and privacy reasons."
      }
    ]
  },
  {
    "id": "2",
    "heading": "Optimize Image Loading Speed",
    "body": "Images take too long to load on the website. It would be great if the loading speed could be improved.",
    "numberOfComments": 8,
    "numberOfUpvotes": 23,
    "category": "Enhancement",
    "comments": [
      {
        "user": "Amy",
        "username": "Amy@babel.com",
        "comment": "I've noticed the slow image loading as well. It's frustrating when browsing the site."
      },
      {
        "user": "David",
        "username": "David@babel.com",
        "comment": "Are the images properly optimized? Optimizing them could significantly improve loading speed."
      },
      {
        "user": "Olivia",
        "username": "Olivia@babel.com",
        "comment": "Maybe utilizing a content delivery network (CDN) could help speed up image loading."
      },
      {
        "user": "William",
        "username": "William9@babel.com",
        "comment": "Is lazy loading implemented? Lazy loading images could enhance the overall performance."
      },
      {
        "user": "Ava",
        "username": "Ava99@babel.com",
        "comment": "I think compressing the images without sacrificing quality might be a good solution."
      },
      {
        "user": "Liam",
        "username": "Liam@babel.com",
        "comment": "Have you considered using progressive image loading techniques?"
      },
      {
        "user": "Emma",
        "username": "Emma99@babel.com",
        "comment": "Optimizing image formats to more efficient ones, like WebP, could improve loading speed."
      },
      {
        "user": "Noah",
        "username": "Noah99@babel.com",
        "comment": "Have you checked the server response times? Slow server response can impact image loading."
      }
    ]
  },
  {
    "id": "3",
    "heading": "Fix Navigation Menu Alignment",
    "body": "The navigation menu is misaligned on mobile devices. It needs to be adjusted to ensure proper display.",
    "numberOfComments": 3,
    "numberOfUpvotes": 12,
    "category": "UI",
    "comments": [
      {
        "user": "Sophia",
        "username": "Sophia@babel.com",
        "comment": "The misalignment of the navigation menu is causing inconvenience. It should be fixed as soon as possible."
      },
      {
        "user": "Ethan",
        "username": "Ethan@babel.com",
        "comment": "I suggest using a responsive design approach to handle the alignment on different screen sizes."
      },
      {
        "user": "Isabella",
        "username": "Ethan@babel.com",
        "comment": "Testing the navigation menu on various mobile devices and resolving alignment issues is crucial for a seamless user experience."
      }
    ]
  },
  {
    "id": "4",
    "heading": "Enhancement: Dark Mode Support",
    "body": "It would be great if the application could provide a dark mode option for users who prefer dark-themed interfaces.",
    "numberOfComments": 10,
    "numberOfUpvotes": 35,
    "category": "Enhancement",
    "comments": [
      {
        "user": "Mason",
        "username": "Mason@babel.com",
        "comment": "Dark mode has become a popular feature. Implementing it would attract more users."
      },
      {
        "user": "Sophia",
        "username": "Sophia@babel.com",
        "comment": "I personally find dark mode easier on the eyes, especially during nighttime browsing."
      },
      {
        "user": "Logan",
        "username": "Logan@babel.com",
        "comment": "Consider adding an option to switch between automatic and manual dark mode based on system preferences."
      },
      {
        "user": "Ava",
        "username": "Ava@babel.com",
        "comment": "The dark mode should have proper contrast ratios to ensure readability of text and elements."
      },
      {
        "user": "William",
        "username": "William@babel.com",
        "comment": "A toggle switch in the settings menu could allow users to easily enable or disable dark mode."
      },
      {
        "user": "Charlotte",
        "username": "Charlotte@babel.com",
        "comment": "When implementing dark mode, make sure to test it across different platforms and browsers for consistency."
      },
      {
        "user": "Michael",
        "username": "Michael@babel.com",
        "comment": "Dark mode is a must-have feature nowadays. It adds a modern touch to the application."
      },
      {
        "user": "Olivia",
        "username": "Olivia@babel.com",
        "comment": "Consider allowing users to schedule dark mode activation based on their preferred timings."
      },
      {
        "user": "James",
        "username": "James@babel.com",
        "comment": "Dark mode can enhance battery life for devices with OLED or AMOLED screens."
      },
      {
        "user": "Sophia",
        "username": "Sophia@babel.com",
        "comment": "I'd love to see a customizable dark mode with options for different color schemes."
      }
    ]
  },
  {
    "id": "5",
    "heading": "Bug: Incorrect Date Display",
    "body": "The date is displaying incorrectly in certain sections of the application. This issue needs to be resolved.",
    "numberOfComments": 2,
    "numberOfUpvotes": 8,
    "category": "Bug",
    "comments": [
      {
        "user": "Emma",
        "comment": "The incorrect date display can lead to confusion and inaccuracies. Fixing it should be a priority."
      },
      {
        "user": "Liam",
        "comment": "Check the date formatting settings and ensure they are consistent across the application."
      }
    ]
  },
  {
    "id": "6",
    "heading": "Add Multi-language Support",
    "body": "To cater to a wider audience, it would be beneficial to have support for multiple languages in the application.",
    "numberOfComments": 7,
    "numberOfUpvotes": 21,
    "category": "Feature",
    "comments": [
      {
        "user": "Noah",
        "comment": "Supporting multiple languages can significantly expand the user base."
      },
      {
        "user": "Sophia",
        "comment": "Translation plugins or APIs can be utilized for easy integration of multi-language support."
      },
      {
        "user": "Liam",
        "comment": "Remember to design the UI with localization in mind to accommodate text expansion and RTL languages."
      },
      {
        "user": "Olivia",
        "comment": "Allowing users to switch languages from the settings menu would be convenient."
      },
      {
        "user": "William",
        "comment": "Consider providing an option for users to contribute translations to improve language support."
      },
      {
        "user": "Emily",
        "comment": "Localization is crucial for global accessibility and better user engagement."
      },
      {
        "user": "Mason",
        "comment": "Keep in mind that each language may have different date, time, and number formats."
      }
    ]
  },
  {
    "id": "7",
    "heading": "Improve Loading Time on Large Datasets",
    "body": "When dealing with large datasets, the application experiences significant loading delays. This needs to be addressed for better performance.",
    "numberOfComments": 4,
    "numberOfUpvotes": 18,
    "category": "Enhancement",
    "comments": [
      {
        "user": "Sophia",
        "comment": "Optimizing data fetching and implementing pagination could improve loading time for large datasets."
      },
      {
        "user": "Oliver",
        "comment": "Consider implementing data caching to minimize repetitive data retrieval and speed up loading."
      },
      {
        "user": "Mia",
        "comment": "Are there any database indexing strategies in place to optimize querying large datasets?"
      },
      {
        "user": "Daniel",
        "comment": "Lazy loading or infinite scrolling could help load large datasets gradually and improve overall performance."
      }
    ]
  },
  {
    "id": "8",
    "heading": "UI: Enhance Button Styling",
    "body": "The buttons in the application lack visual appeal. They should be redesigned to have a more modern and attractive appearance.",
    "numberOfComments": 6,
    "numberOfUpvotes": 14,
    "category": "UI",
    "comments": [
      {
        "user": "Olivia",
        "comment": "The buttons play a crucial role in the user interface. Improving their visual design would enhance the overall user experience."
      },
      {
        "user": "Ethan",
        "comment": "Consider adding subtle hover effects to the buttons for better interactivity."
      },
      {
        "user": "Sophia",
        "comment": "Using contrasting colors and modern typography can make the buttons more visually appealing."
      },
      {
        "user": "Ava",
        "comment": "Button animations or transitions could add a touch of sophistication to the user interface."
      },
      {
        "user": "Lucas",
        "comment": "Ensure that the button styles are consistent across different sections of the application."
      },
      {
        "user": "Emily",
        "comment": "Conduct user testing to gather feedback on the new button design and iterate accordingly."
      }
    ]
  },
  {
    "id": "9",
    "heading": "Bug: Incorrect Calculation in Reports",
    "body": "The calculations in the reports section are producing inaccurate results. This bug needs to be fixed for accurate data analysis.",
    "numberOfComments": 9,
    "numberOfUpvotes": 27,
    "category": "Bug",
    "comments": [
      {
        "user": "Oliver",
        "comment": "Inaccurate calculations can lead to wrong decision-making. It's crucial to fix this bug as soon as possible."
      },
      {
        "user": "Ethan",
        "comment": "Check the formulas and logic used for calculations to identify the source of the inaccuracies."
      },
      {
        "user": "Isabella",
        "comment": "Creating unit tests for the calculation functions could help identify and fix the inaccuracies."
      },
      {
        "user": "Mason",
        "comment": "Consider involving domain experts to verify the accuracy of the calculations in the reports."
      },
      {
        "user": "Charlotte",
        "comment": "Thoroughly validate the input data used for calculations to ensure accuracy."
      },
      {
        "user": "William",
        "comment": "Logging and analyzing the intermediate calculation steps might provide insights into the source of the inaccuracies."
      },
      {
        "user": "Sophia",
        "comment": "Make sure to run regression tests after fixing the bug to avoid reintroducing the inaccuracies."
      },
      {
        "user": "Aiden",
        "comment": "Communicate the fix to users and provide them with accurate reports to rebuild trust in the application."
      },
      {
        "user": "Emily",
        "comment": "Perform thorough testing on different datasets to ensure the accuracy of the calculations."
      }
    ]
  },
  {
    "id": "10",
    "heading": "Feature: Integration with Social Media Platforms",
    "body": "Allow users to connect their accounts with social media platforms for seamless sharing and social interactions.",
    "numberOfComments": 3,
    "numberOfUpvotes": 11,
    "category": "Feature",
    "comments": [
      {
        "user": "Noah",
        "comment": "Integrating with social media platforms would enhance the user experience and increase engagement."
      },
      {
        "user": "Emma",
        "comment": "Consider providing options for users to selectively share content or disable automatic sharing."
      },
      {
        "user": "Oliver",
        "comment": "Ensure that the integration complies with the privacy policies and guidelines of the social media platforms."
      }
    ]
  }
]
